0.orig/pointDisplacement
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       pointVectorField;
    object      pointDisplacement;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    bottom1
    {
        type            zeroGradient;
    }
    bottom2
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    leftwall
    {
        type            waveMakerZ;
        value           uniform (0 0 0);

        motionType      piston;
        secondOrder     true;
        n               (1 0 0);
        depth           0.55;
        rampTime        3.0;
        numHarmonics    32;
        inputFile       "signal";
    }
    back
    {
        type            empty;
    }
    front
    {
        type            empty;
    }
    rightwall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    top
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
